<!-- dflook/terraform-github-actions {"workspace":"large-plan","backend":"89742f4215583d8dfc94092b063da29d549eb09b7d1a43bb998251a15bda12f4","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #233 at https://github.com/dflook/terraform-github-actions/actions/runs/2812635610","plan_hash":"e63c361f755ab8954ac5a9c16ef6d766cb1480119ef9d251de522e7ffe18a7ae","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __large-plan__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "NC4zigkyci" -> (known after apply)
  ~ foreach = "X9eROTFD9F" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #233](https://github.com/dflook/terraform-github-actions/actions/runs/2812635610)